#### BuiltInFailures.ColumnFailures Members

---

|  |
| --- |
| BuiltInFailures ColumnFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ColumnFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ColumnAndTargetAreConcrete | Column and target are both concrete. Geometries have been joined. |
| Public property Static member | ColumnBaseAboveTopError | The column base can't be moved above its top. |
| Public property Static member | ColumnBaseAboveTopFailure | The column base can't be moved above its top. |
| Public property Static member | ColumnJoinNonhitFailure | The highlighted column can't maintain attachment to the target. It will be treated as unattached until it can intersect. |
| Public property Static member | ColumnTopBelowBaseError | The column top can't be moved below its base. |
| Public property Static member | ColumnTopBelowBaseFailure | The column top can't be moved below its base. |
| Public property Static member | ColumnZeroHeightError | The column can't have zero height |
| Public property Static member | ColumnZeroHeightFailure | The column can't have zero height |

# See Also

BuiltInFailures ColumnFailures Class

Autodesk.Revit.DB Namespace